{
  "app": {
    "name": "Bloomreach Engagement Sidebar",
    "short_description": "Bloomreach Engagement data in your Zendesk Ticket Sidebar.",
    "long_description": "# Bloomreach Engagement\n\nA single platform that combines the power of a customer data platform, email, messaging, ads, artificial intelligence, marketing automation, and web personalization so you can create marketing campaigns across channels that drive revenue.\n\n### Power Customer Experiences with Unified Data\n\nRemove data silos and unify customer data from any source into 360° customer profiles. Use this data to launch personalized campaigns in real-time through Bloomreach Engagement built-in-channels.\n\n### Easily Activate your Data Across Channels\n\nPick the channels you need to deliver remarkable and connected customer experiences. Select from our wide portfolio on built-in channels and orchestrate them into a meaningful journey.\n\n* email,\n\n* SMS,\n\n* web/mobile push, \n\n* in-app messaging,\n\n* WhatsApp,\n\n* Adtech audiences,\n\n* web hooks, or\n\n* API.\n\n### Enjoy Powerful Integrations and Web hooks\n\nConnect to various 3rd-party services through our built-in integrations or use our API to enrich your data and ensure you have everything it takes to design highly personalized journeys your customers will love.\n\n## Build Unique Experiences Across All Channels and Devices\n\n### Drag-and-Drop Personalized Omnichannel Journeys\n\nGive your marketers total control over every aspect of the customer journey. Add real-time triggers, customer segments, conditions, channels, and design end-to-end automated omnichannel flows.\n\n### Rocket-fast Time-to-value With our Plug and Play Use Cases\n\nMaximize your ROI thanks to our out-of-the-box use cases enabling you to launch hyper-personalized marketing campaigns and advanced dashboards that follow best practices in no time. Capitalize on Bloomreach expert knowledge collected over years of working with top players on the market.\n\n### Recommend the Right Products\n\nOffer the right products regardless of channel. Use any of our 12 out-of-the-box recommendation templates powered by advanced AI algorithms and deliver consistent experience across all channels.\n\n### Advanced Predictions the Easy Way\n\nPredict customer behavior, or find the best time to send an email with a few simple clicks. Our prediction templates powered by smart machine learning algorithms will help you create intelligent and highly-targeted campaigns.\n\n## Zendesk Integration\n\nAccess information stored in our Single View of the Customer from within the sidebar of a Zendesk ticket:\n\n- **Aggregates:** customer attributes that are calculated from already existing data.\n\n- **Expressions:** Formula that serves as a derived attribute.\n\n- **Properties:** Data stored about a customer\n\n- **Predictions:** Ranking your customer with a different degree of probability to complete certain actions (e.g. purchase, visit, churn). Derive insights from the past, present to predicted future behavior.\n\n- **Segmentations:** These allow you to group **customers** on the basis of their attributes and activities, and help you to understand how these groups differ from each other.\n\n- **Recommendations:** We offer a wide selection of product recommendation models, enabling you to select from over 12 out‑of‑the‑box recommendation templates ready to be deployed on your website, emails or other available channels. For advanced users, we offer the possibility to create a custom recommendation model based on your specific business needs.\n\n- **Consents:** manage your subscription policies and tracks any changes to consents for every customer.", 
    "installation_instructions": "1) Input your engagement project id\n\n    Information on your project token can be found [here](https://documentation.bloomreach.com/engagement/docs/project-settings-2)\n\n2) Input your engagement hostname. \n\nThis is the domain of your Engagement admin interface - e.g. demo_project.exponea.com\n\n3) Input your engagement API hostname. This is available at project settings > api Base URL.\n\nYour Customer Success Manager will be happy to help you with you API Hostname.\n\n4) In Engagement, generate an API keypair for a private group with read-only access to Managed Endpoint API and all the data fields you are interested in. Turn these into a base 64 encoded token. An easy way to achieve this is to install nodejs, start the repl and run: \n    ```\n    console.log(Buffer.from('<paste_public_key_here>:<paste_private_key_here>').toString('base64')) \n    ```\n    put this value into the Engagement_token field\n\nFor more details, please see documentation on authentication [here](https://documentation.bloomreach.com/engagement/reference/authentication)\n\n5) The final thing to do is to configure the fields you would like to display. You have 2 options here:\n\n6)Use Managed Endpoint API - configured in [BR Engagement UI](https://documentation.bloomreach.com/engagement/reference/managed-endpoints-api). Make sure the API group configured has access to Managed Endpoint API. Don't forget to enable the Managed Endpoint API and use the URL provided for this endpoint into Engagement Managed Endpoint API URL field. The Managed API payload can be fully custom and looks like this:\n```\n{\n  \"Name\": \"{{ customer.first_name }} {{ customer.last_name }}\",\n  \"Email engagement\": \"{{ segmentations['5fc3d611a59cf881d45b2ff6'] }}\",\n  \"Last cart update\": \"{{ expressions['5f5776b57e8f28c9c93d2c90'] | from_timestamp('US')  }}\",\n  \"html\": \"<b>Recommendations:</b><table>{% for item in recommendations('5f5b6aabd0ef9bf5633ea54b', 8) %}<tr><td><a href='{{ item.url }}' target=_blank><img src='{{ item.image }}' width=64></a></td><td><a href='{{ item.url }}' target=_blank>{{ item.title }}</a></td></tr>{% endfor %}</table>\"  \n}\n```\n\n7) Alternativelly, if no Managed Endpoint is used, use Data API to fetch raw data. This is configured in the Engagement_payload field as a JSON object in the form:\n\n```\n    {\n    'fields' : [{\n      'type': 'segmentation attribute etc',\n      'id' : 'the internal Engagement id of the field',\n      'label' : 'How you would like the field labelled in your Zendesk sidebar'\n    },\n    {...another field...},\n    {...another field...}\n    ]}\n    ```\n    The JSON above is the exact JSON passed to the [customer attribute API call] - (https://documentation.bloomreach.com/engagement/reference/customer-api-overview-1) extended with a 'label' field as a friendly display name within Zendesk.\n\nField ID's can be ascertained by looking at the URL within Engagement when accessing the field in question.\n\n",
    "parameters": {
      "ENGAGEMENT_PROJECT": {
        "label": "Engagement Project Id",
        "helpText": "The id Of your Engagement Project, found on the settings page."
      },
      "ENGAGEMENT_PROJECT_NAME": {
        "label": "Engagement Project Name",
        "helpText": "The name of you Engagement Project, found on the settings pages."
      },
      "ENGAGEMENT_HOSTNAME": {
        "label": "Engagement Hostname",
        "helpText": "The base URL that you log into Engagement using."
      },
      "ENGAGEMENT_API_HOSTNAME": {
        "label": "Engagement API Hostname",
        "helpText": "The base URL for engagement API Calls - found in your project settings."
      },
      "ENGAGEMENT_TOKEN": {
        "label": "Engagement Token",
        "helpText": "Base 64 encoding of your public and private Engagement project keys. Most easily generated using nodejs with the following command from the REPL: console.log(Buffer.from('<public_key>:<private_key>').toString('base64'))"
      },
      "ENGAGEMENT_KEY": {
        "label": "Engagement API Key",
        "helpText": "Bloomreach Enagagement API key."
      },
      "ENGAGEMENT_SECRET": {
        "label": "Engagement API Secret",
        "helpText": "Bloomreach Enagagement API Secret."
      },
      "ENGAGEMENT_IDENTIFIER": {
        "label": "Identifier holding email value",
        "helpText": "Bloomreach Engagement Identifier used to query user data."
      },
      "ENGAGEMENT_MANAGED_API_URL": {
        "label": "Engagement Managed Endpoint API URL (recommended)",
        "helpText": "The full URL managed endpoint API returning JSON object."
      },
      "ENGAGEMENT_PAYLOAD": {
        "label": "Engagement Fields (deprecated)",
        "helpText": "Use if no Managed Endpoint API not available. A JSON document describing the fields you want to display. In the form: {'fields' : [{'type': 'segmentation attribute etc','id' : 'the internal Engagement id of the field','label' : 'what you want the name to be when display inside Zendesk'},{...},{...}]}"
      }
    }
  }
}
