{
  "app": {
    "name": "Bloomreach Engagement Zendesk Sidebar",
    "short_description": "Bloomreach Engagement data in your Zendesk Ticket Siderbar.",
    "long_description": "Access any of your customer based Blomreach Engagement data in your Zendesk Ticketing sidebar. Simply and Securely. Click on the Engagement logo to access the full customer record.",
    "installation_instructions": "Please fill in the fields with the relevant fields from your Bloomreach Engagement instance. Engagement payload is a JSON file similar to {'fields':{['type' : 'the type of field inside engagement', 'id': 'the field id inside engagement', 'label' : 'what you want the field to be displayed as on the sidebar']}}. You can display as many fields as you wish. The engagement token is created as a base64 hash of your private and public key. Most easily done from NodeJS REPL using: console.log(Buffer.from('<public_key>:<private_key>').toString('base64'))",
    "parameters": {
      "ENGAGEMENT_PROJECT" : {"label" : "Engagement Project Id", "helpText" : "The Id Of you Engagement Project, found on the settings page."},
      "ENGAGEMENT_HOSTNAME" : {"label" : "Engagement Hostname", "helpText" : "The base URL that you log into Engagement using."},
      "ENGAGEMENT_API_HOSTNAME" : {"label" : "Engagement API Hostname", "helpText" : "The base URL for engagement API Calls - found in your project settings."},
      "ENGAGEMENT_TOKEN" : {"label" : "Engagement Token", "helpText" : "Base 64 encoding of your public and private Engagement project keys. Most easily generated using nodejs with the following command from the REPL: console.log(Buffer.from('<public_key>:<private_key>').toString('base64'))"},
      "ENGAGEMENT_PAYLOAD" : {"label" : "Engagement Fields", "helpText" : "A JSON document describing the fields you want to display. In the form: {'fields' : [{'type': 'segmentation attribute etc','id' : 'the internal Engagement id of the field','label' : 'what you want the name to be when display inside Zendesk'},{...},{...}]} "}}
  }
}
