{
  "app": {
    "name": "Bloomreach Engagement Sidebar",
    "short_description": "Bloomreach Engagement data in your Zendesk Ticket Sidebar.",
    "long_description": "# Bloomreach Engagement\n\nA single platform that combines the power of a customer data platform, email, messaging, ads, artificial intelligence, marketing automation, and web personalization so you can create marketing campaigns across channels that drive revenue.\n\n### Power Customer Experiences with Unified Data\n\nRemove data silos and unify customer data from any source into 360° customer profiles. Use this data to launch personalized campaigns in real-time through Bloomreach Engagement built-in channels.\n\n### Easily Activate your Data Across Channels\n\nPick the channels you need to deliver remarkable and connected customer experiences. Select from our wide portfolio of built-in channels and orchestrate them into a meaningful journey.\n\n* email,\n\n* SMS,\n\n* web/mobile push, \n\n* in-app messaging,\n\n* WhatsApp,\n\n* Adtech audiences,\n\n* webhooks, or\n\n* API.\n\n### Enjoy Powerful Integrations and Web hooks\n\nConnect to various 3rd-party services through our built-in integrations or use our API to enrich your data and ensure you have everything it takes to design highly personalized journeys your customers will love.\n\n## Build Unique Experiences Across All Channels and Devices\n\n### Drag-and-Drop Personalized Omnichannel Journeys\n\nGive your marketers total control over every aspect of the customer journey. Add real-time triggers, customer segments, conditions and channels, and design end-to-end automated omnichannel flows.\n\n### Rocket-fast Time-to-value With our Plug and Play Use Cases\n\nMaximize your ROI thanks to our out-of-the-box use cases enabling you to launch hyper-personalized marketing campaigns and advanced dashboards that follow best practices in no time. Capitalize on Bloomreach expert knowledge collected over years of working with top players on the market.\n\n### Recommend the Right Products\n\nOffer the right products regardless of channel. Use any of our 12 out-of-the-box recommendation templates powered by advanced AI algorithms and deliver a consistent experience across all channels.\n\n### Advanced Predictions the Easy Way\n\nPredict customer behaviour, or find the best time to send an email with a few simple clicks. Our prediction templates powered by smart machine learning algorithms will help you create intelligent and highly-targeted campaigns.\n\n## Zendesk Integration\n\nAccess information stored in our Single View of the Customer from within the sidebar of a Zendesk ticket:\n\n- **Aggregates:** customer attributes that are calculated from already existing data.\n\n- **Expressions:** Formula that serves as a derived attribute.\n\n- **Properties:** Data stored about a customer\n\n- **Predictions:** Ranking your customer with a different degree of probability to complete certain actions (e.g. purchase, visit, churn). Derive insights from the past, and present to predict future behaviour.\n\n- **Segmentations:** These allow you to group **customers** based on their attributes and activities, and help you to understand how these groups differ from each other.\n\n- **Recommendations:** We offer a wide selection of product recommendation models, enabling you to select from over 12 out‑of‑the‑box recommendation templates ready to be deployed on your website, emails or other available channels. For advanced users, we offer the possibility to create a custom recommendation model based on your specific business needs.\n\n- **Consents:** manage your subscription policies and track any changes to consents for every customer.", 
    "installation_instructions": 
      "\n1. Title\n\n The headline of the sidebar widget - eg. `Customer Details`.\n\n2. Engagement Hostname\n\n The base URL part from **your** project URL, eg. `https:\/\/`**`demoapp.exponea.com`**`\/p\/clientproject\/home`.\n\n3. Engagement Project Name\n\n The name of **your** Engagement Project, part of the Project URL, `https:\/\/demoapp.exponea.com\/p\/`**`clientproject`**`\/home`.\n\n4. Input your Engagement Project Token\n\n Information on your project token can be found [here](https:\/\/documentation.bloomreach.com\/engagement\/docs\/project-settings-2). Looks like similar to `cc7cc3c6-6b36-a11b-ffaa-52f58fe58f19`.\n\n5. Input your engagement API Base URL\n\n This is available at `Project Settings` -> `Api Base URL`. Looks like **`api-demoapp.exponea.com`**\n\n6. API Key ID and API Key Secret\n\n In `Engagement Settings` > `Access Management` > `API`, generate an API keypair for a `private group` that you create, with read-only access to `Managed Endpoint API` and all the data fields you are interested in. For more details, please see [documentation on authentication](https:\/\/documentation.bloomreach.com\/engagement\/reference\/authentication).\n\n7. The final thing to do is to configure the fields you would like to display. You have 2 options here:\n\n  1. Use `Managed Endpoint API` - configured in [BR Engagement UI](https:\/\/documentation.bloomreach.com\/engagement\/reference\/managed-endpoints-api). Ensure the API group configured has access to this newly created `Managed Endpoint API`. Don't forget to enable the Managed Endpoint API and copy the URL provided for this endpoint into the Engagement Managed Endpoint API URL field. \n\n        The Managed API payload is fully custom and looks like this:\n\n      ```\n      {\n          \"Name\": \"{{ customer.first_name }} {{ customer.last_name }}\",\n          \"Email engagement\": \"{{ segmentations['5fc3d611a59cf881d45b2ff6'] }}\",\n          \"Last cart update\": \"{{ expressions['5f5776b57e8f28c9c93d2c90'] | from_timestamp('US')  }}\",\n          \"html\": \"<b>Recommendations:<\/b><table>{% for item in recommendations('5f5b6aabd0ef9bf5633ea54b', 8) %}<tr><td><a href='{{ item.url }}' target=_blank><img src='{{ item.image }}' width=64><\/a><\/td><td><a href='{{ item.url }}' target=_blank>{{ item.title }}<\/a><\/td><\/tr>{% endfor %}<\/table>\"  \n        }\n      ```\n\n  2. Alternatively, if no Managed Endpoint is used, use [Data API](https:\/\/documentation.bloomreach.com\/engagement\/reference\/customer-attributes-2) to fetch raw data. The data requested is configured in the `Engagement_payload` field as a JSON object in the form:\n\n        ```\n        {\n            'fields' : [\n                {\n                'type': 'segmentation attribute etc',\n                'id': 'the internal Engagement id of the field',\n                'label': 'How you would like the field labelled in your Zendesk sidebar'\n                },\n                {...another field...},\n                {...another field...}\n            ]\n        }\n        ```\n\n        The JSON above is the exact JSON passed to the [customer attribute API call](https:\/\/documentation.bloomreach.com\/engagement\/reference\/customer-api-overview-1) extended with a 'label' field as a friendly display name within Zendesk.\n\n        The exact values you require can be found by referring to the Bloomreach Engagement API Reference [here](https:\/\/documentation.bloomreach.com\/engagement\/reference\/welcome).\n\n8. If you want to send data and updates into Bloomreach Engagement, the Webhook configuration is already automatically created for you. Now you need to [create triggers in Zendesk](https:\/\/support.zendesk.com\/hc\/en-us\/articles\/4408886797466-Creating-triggers-for-automatic-ticket-updates-and-notifications) that send Events to Bloomreach Engagement. To do this, go to `Admin` -> `Objects and rules` -> `Business Rules` -> `Triggers`. Then create a new trigger, name it, and give it a description and category.\n\n Under `Conditions` you will need to specify the situations when the Trigger runs. If you want to notify Bloomreach Engagement of a ticket being created and then consequently closed\/solved, you can use the logic below.\n\n Under `Actions`, you will want to select `Notify active webhook` and select the Bloomreach webhook from the second dropdown.\n\n **Configuration of the `POST` request body**, that will be sent when triggering the webhook, **is required**. It needs to adhere to the format of the Bloomreach Engagement Tracking API endpoint. This is a simple example of payload: \n \n  ```\n  {\n    \"customer_ids\": {\n        \"registered\": \"{{ticket.requester.email}}\"\n    },\n    \"properties\": {\n        \"body\": \"{{ticket.description}}\",\n        \"status\": \"{{ticket.status}}\",\n        \"subject\": \"{{ticket.title}}\",\n        \"type\": \"{{ticket.ticket_type}}\",\n        \"ticket_id\": \"{{ticket.id}}\",\n        \"priority\": \"{{ticket.priority}}\",\n        \"support_suite\": \"Zendesk\"\n    },\n    \"event_type\": \"support_ticket\"\n\t}\n```\n",
    "parameters": {
      "ENGAGEMENT_HOSTNAME": {
        "label": "Engagement Hostname",
        "helpText": "The base URL part from **your** project URL (https://**demoapp.exponea.com**/p/clientproject/home)"
      },
      "ENGAGEMENT_PROJECT_NAME": {
        "label": "Engagement Project Name",
        "helpText": "The name of **your** Engagement Project, part of the Project URL (https://demoapp.exponea.com/p/**clientproject**/home)"
      },
      "ENGAGEMENT_PROJECT": {
        "label": "Engagement Project Token",
        "helpText": "The Engagement Project Token, found on the Project API settings page. (similar to **cc7cc3c6-6b36-a11b-ffaa-52f58fe58f19**)"
      },
      "ENGAGEMENT_API_HOSTNAME": {
        "label": "Engagement API Base URL",
        "helpText": "The base URL for engagement API Calls - found in your project API settings. (similar to **api-demoapp.exponea.com**)"
      },
      "ENGAGEMENT_KEY": {
        "label": "Engagement API Key ID",
        "helpText": "Bloomreach Enagagement API key - found in your project API settings (similar to **r7a1y096nxijrowv4ibzl2kqnlldoop12pcfofzb2e4sxgjhmjyxpn8b05vm36e5**)"
      },
      "ENGAGEMENT_SECRET": {
        "label": "Engagement API Secret",
        "helpText": "Bloomreach Enagagement API Secret. Shown only when you generate a new key! in the project API settings (similar to **oop96nxijrowv4ibzl2kqnll12pcfof05vm36e5zb2e4sxgjhmjyr7a1y0dxpn8b**)"
      },
      "ENGAGEMENT_IDENTIFIER": {
        "label": "Identifier holding plain email value",
        "helpText": "Bloomreach Engagement Identifier used to query user data."
      },
      "ENGAGEMENT_MANAGED_API_URL": {
        "label": "Engagement Managed Endpoint API URL (recommended)",
        "helpText": "The full URL managed endpoint API returning JSON object."
      },
      "ENGAGEMENT_PAYLOAD": {
        "label": "Engagement Fields (deprecated)",
        "helpText": "Use if no Managed Endpoint API not available. A JSON document describing the fields you want to display. In the form: {'fields' : [{'type': 'segmentation attribute etc','id' : 'the internal Engagement id of the field','label' : 'what you want the name to be when display inside Zendesk'},{...},{...}]}"
      }
    }
  }
}
